'use strict';
const BaseException = require('../BaseException');
const errorStatus = {
    2020200: '商品处理异常',
    2020201: '商品数据错误',
    2020202: '商品数据不完整',
    2020203: '商品主规格重复',
    2020204: '商品规格组合重复',
    2020205: '商品规格数据有误',
    2020206: '商品规格所有库存为0',
    2020207: '商品从数据错误',
    2020208: '商品操作类型错误',
    2020209: '商品禁止操作',
    2020210: '商品获取异常',
    2020211: '商品审核定时数据错误',
    2020212: '商品草稿超限',
    2020213: '商品库存刊登量不足',
    2020231: '商品分组名称重复',
    2020251: '商品定时规则数据错误',
    2020252: '商品分类为空',
    2020253: '卖家账号数量与商品数量不匹配错误',
    2020254: '商品状态已变更，无法完成操作',
    2020354: '主商品禁止临时删除',
    2020355: '主商品临时删除失败',
    2020370: '站点商品临时删除失败',
    2020359: '编辑审核商品列表异常',
    2020401: '主商品禁止永久删除',
    2020402: '主商品永久删除失败',
    2020403: '主商品还原失败',
    2020404: '站点商品永久删除失败',
    2020405: '站点商品禁止还原',
    2020406: '站点商品还原失败',
    9999999: '站点状态对应错误' // 自定义错误，状态不对返回状态
};
class BasePublishException extends BaseException {

    constructor(name, msg) {
        if (name && !msg) {
            msg = errorStatus[name];
        }
        super(name, msg);
    }

}

module.exports = BasePublishException;
